// 效果牌：按阶分类（1阶~6阶）
const effectRaw = {
    "1阶": [
        "吸纳人才", "1阶英雄兑换券", "研读会", "高级人才", "援护战术",
        "古币", "惊喜补贴", "招兵买马", "1阶英雄"
    ],
    "2阶": [
        "跳级", "图腾仪式", "2阶英雄", "古币多多", "弦音",
        "2阶英雄兑换券", "临阵磨枪", "唤醒", "演练战术", "推演战术",
        "特训战术", "招募战术", "简易协作"
    ],
    "3阶": [
        "精致古币", "无阵营征召令", "精密协作", "经典研读会", "八方来援",
        "3阶英雄兑换券", "武装之力", "遗志", "呼朋唤友", "整备高手",
        "登场人物", "广纳良才", "大河流域征召令", "日落海征召令", "逐鹿征召令",
        "三分征召令", "河洛征召令", "换帅", "照影", "助力核心",
        "超级补贴", "3阶英雄"
    ],
    "4阶": [
        "夺取之术", "4阶英雄", "高阶演练战术", "武装重构", "阵营祝福",
        "发号施令", "高阶招募战术", "高阶特训战术", "高阶援护战术",
        "4阶英雄兑换券", "扶倾济弱", "妙音", "乱世", "战前宣誓",
        "逍遥自在", "牺牲品", "闪现突击者", "开团号令", "远洋宝藏"
    ],
    "5阶": [
        "因材施教", "传承", "高阶推演战术", "度命之护", "武装分解",
        "久经沙场", "机关秘典", "图腾祝福", "珍品宝箱", "移花接木",
        "5阶英雄", "5阶英雄兑换券", "有福同享", "求贤", "奇谋",
        "开局狂飙", "能量大爆炸", "集体唤醒", "全军动员", "精选武装"
    ],
    "6阶": [
        "众星闪耀", "展翅腾飞", "军械库", "众星拱月", "神兵天降",
        "呼风唤雨", "破境之证", "天籁琴音", "绝处逢生", "化铁为金",
        "超级复印机", "一线生机", "能量超新星", "扶摇直上", "狂飙三倍速",
        "四人同行", "新生力量", "沧海拾遗"
    ]
};
const equipList = [
    {
        id: 1,
        name: "吸纳人才",
        type: "一阶",
        pos: "通用",
        desc: " 卡牌4选1（英雄牌）。",
        source: "该卡通过效果锦囊等渠道获得。",
        img: "images/effectcard/xiyinrencai.png",
        },
    {
];


let allEffectData = [];
(() => {
    let idCounter = 1;
    // 循环阶数生成每条卡牌数据
    for (const tier of Object.keys(effectRaw)) {
        const nameList = effectRaw[tier];
        for (const name of nameList) {
            allEffectData.push({
                id: idCounter++,
                name: name,
                type: tier, // 类型=阶数，筛选直接用阶
                img: `images/effect/${name}.png`,          // 弹窗大图
                smallImg: `images/effect/small/${name}.png`,// 列表小图
                desc: "",
                source: "",
                keywords: []
            })
        }
    }
})();

export { allEffectData };
