// equip.js 装备数据源
const equipRaw = {
    "基础装备": ["大棒", "风暴巨剑", "雷鸣刃", "力量腰带", "破碎圣杯", "圣者法典", "守护者之铠", "速击之枪"],
    "普通装备": ["霸者重铠", "不死鸟之眼", "不祥征兆", "炽热支配者", "纯净苍穹", "法源之杯", "反伤重甲", "寒霜侵袭", "红莲炎甲", "红魔", "极寒风暴", "金色圣剑", "近卫荣耀", "聚灵水晶", "名刀・司命", "冥王", "魔律之刃", "魔女斗篷", "凝渊", "破茧之衣", "破晓", "日渊", "生命魔典", "痛苦面具", "无尽巨剑", "贤者之书", "虚无法杖", "影牙", "御灵之纱", "制裁之剑", "铸梦・逐风", "自然法杖"],
    "天赋装备": ["不屈意志", "断念", "法潮灵杖", "根源之力", "鼓舞之戒", "光辉圣铠", "护命灵珠", "魂祭绝刃", "魂灭灵冠", "灵泉法杖", "灵泉项链", "梦魇之牙", "末世", "怒神项链", "破妄之刃", "破阵战芒", "强敌克星"],
    "特殊装备": ["三分旗帜", "阿科米亚之子", "百锻刀", "捕能手套", "分身镜", "机器头", "静谧之铃", "聚灵法杖", "怒莲之刺", "磐石之心", "青莲剑谱", "驱雷", "热血拳套", "盛华", "噬神之书", "套娃枪", "小鹿的庇护", "学识宝石", "银莲庇佑", "征服之剑"]
};

let allEquipData = [];
let currentEquipType = 'all';
let equipSearchKw = '';

(() => {
    let idCounter = 1;
    for (const equipType of Object.keys(equipRaw)) {
        const list = equipRaw[equipType];
        for (const name of list) {
            allEquipData.push({
                id: idCounter++,
                name: name,
                type: equipType,
                img: `images/equip/${name}.png`,
                desc: "",
                source: "",
                keywords: []
            })
        }
    }
})();

// 导出，给主页面js引入使用
export { allEquipData, equipRaw };
